In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("employees.csv")

In [4]:
df

      name   salary department   age
0    Alice  50000.0         HR  25.0
1      Bob  60000.0         IT  30.0
2  Charlie      NaN         IT  35.0
3    David  45000.0        NaN  22.0
4      Eve  70000.0         HR   NaN

In [6]:
df_filled = df.fillna({
    "department":"Unassinged"
})

In [7]:
df_filled

      name   salary  department   age
0    Alice  50000.0          HR  25.0
1      Bob  60000.0          IT  30.0
2  Charlie      NaN          IT  35.0
3    David  45000.0  Unassinged  22.0
4      Eve  70000.0          HR   NaN

In [14]:
df_clean = df_filled.dropna()

In [15]:
df_clean

    name   salary  department   age
0  Alice  50000.0          HR  25.0
1    Bob  60000.0          IT  30.0
3  David  45000.0  Unassinged  22.0